resource/request_file/Health/Religare_Health_Proposal.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:rel="http://relinterface.insurance.symbiosys.c2lbiz.com" xmlns:xsd="http://intf.insurance.symbiosys.c2lbiz.com/xsd">
    <soap:Header />
    <soap:Body>
        <rel:createPolicy>
            <rel:intIO>
                <xsd:policy>
                    <xsd:addOns>___addon_selected___</xsd:addOns>
                    <xsd:loanAmount>___loan_amount___</xsd:loanAmount>
                    <xsd:isPaRequired>YES</xsd:isPaRequired>
                    <xsd:baseProductId>___base_product_id___</xsd:baseProductId>
                    <xsd:businessTypeCd>NEWBUSINESS</xsd:businessTypeCd>
                    <xsd:baseAgentId>___insurer_integration_agent_code___</xsd:baseAgentId>
                    <xsd:coverType>___health_insurance_type___</xsd:coverType>
                    <xsd:partyDOList>
                        <xsd:birthDt>___birth_date___</xsd:birthDt>
                        <xsd:firstName>___first_name___</xsd:firstName>
                        <xsd:genderCd>___member_1_gender_2___</xsd:genderCd>
                        <xsd:guid>___crn____1</xsd:guid>
                        <xsd:lastName>___last_name___</xsd:lastName>
                        <xsd:partyAddressDOList>
                            <xsd:addressLine1Lang1>___permanent_address_1___</xsd:addressLine1Lang1>
                            <xsd:addressLine2Lang1>___permanent_address_2___ ___permanent_address_3___</xsd:addressLine2Lang1>
                            <xsd:addressTypeCd>PERMANENT</xsd:addressTypeCd>
                            <xsd:areaCd></xsd:areaCd>
                            <xsd:cityCd></xsd:cityCd>
                            <xsd:pinCode>___permanent_pincode___</xsd:pinCode>
                            <xsd:stateCd></xsd:stateCd>
                            <xsd:countryCd>IND</xsd:countryCd>
                        </xsd:partyAddressDOList>
                        <xsd:partyAddressDOList>
                            <xsd:addressLine1Lang1>___permanent_address_1___</xsd:addressLine1Lang1>
                            <xsd:addressLine2Lang1>___permanent_address_2___ ___permanent_address_3___</xsd:addressLine2Lang1>
                            <xsd:addressTypeCd>COMMUNICATION</xsd:addressTypeCd>
                            <xsd:areaCd></xsd:areaCd>
                            <xsd:cityCd></xsd:cityCd>
                            <xsd:pinCode>___permanent_pincode___</xsd:pinCode>
                            <xsd:stateCd></xsd:stateCd>
                            <xsd:countryCd>IND</xsd:countryCd>
                        </xsd:partyAddressDOList>
                        <xsd:partyContactDOList>
                            <xsd:contactNum>___mobile___</xsd:contactNum>
                            <xsd:contactTypeCd>MOBILE</xsd:contactTypeCd>
                            <xsd:stdCode></xsd:stdCode>
                        </xsd:partyContactDOList>
                        <xsd:partyEmailDOList>
                            <xsd:emailAddress>___email___</xsd:emailAddress>
                            <xsd:emailTypeCd>PERSONAL</xsd:emailTypeCd>
                        </xsd:partyEmailDOList>
                        <xsd:partyIdentityDOList>
                            <xsd:identityNum>___pan___</xsd:identityNum>
                            <xsd:identityTypeCd>PAN</xsd:identityTypeCd>
                        </xsd:partyIdentityDOList>
                        <xsd:relationCd>SELF</xsd:relationCd>
                        <xsd:roleCd>PROPOSER</xsd:roleCd>
                        <xsd:titleCd>___salutation___</xsd:titleCd>
                    </xsd:partyDOList>
                    <!--InsurersDetail_Start-->
                    <xsd:partyDOList>
                        <xsd:birthDt>___member_array_birth_date___</xsd:birthDt>
                        <xsd:firstName>___member_array_first_name___</xsd:firstName>
                        <xsd:genderCd>___member_array_gender_2___</xsd:genderCd>
                        <xsd:guid>___crn_______member_array_inc___</xsd:guid>
                        <xsd:lastName>___member_array_last_name___</xsd:lastName>
                        <xsd:partyAddressDOList>
                            <xsd:addressLine1Lang1>___permanent_address_1___</xsd:addressLine1Lang1>
                            <xsd:addressLine2Lang1>___permanent_address_2___ ___permanent_address_3___</xsd:addressLine2Lang1>
                            <xsd:addressTypeCd>PERMANENT</xsd:addressTypeCd>
                            <xsd:areaCd>___area___</xsd:areaCd>
                            <xsd:cityCd>___city___</xsd:cityCd>
                            <xsd:pinCode>___permanent_pincode___</xsd:pinCode>
                            <xsd:stateCd>___state___</xsd:stateCd>
                            <xsd:countryCd>IND</xsd:countryCd>
                        </xsd:partyAddressDOList>
                        <xsd:partyAddressDOList>
                            <xsd:addressLine1Lang1>___permanent_address_1___</xsd:addressLine1Lang1>
                            <xsd:addressLine2Lang1>___permanent_address_2___ ___permanent_address_3___</xsd:addressLine2Lang1>
                            <xsd:addressTypeCd>COMMUNICATION</xsd:addressTypeCd>
                            <xsd:areaCd>___area___</xsd:areaCd>
                            <xsd:cityCd>___city___</xsd:cityCd>
                            <xsd:pinCode>___permanent_pincode___</xsd:pinCode>
                            <xsd:stateCd>___state___</xsd:stateCd>
                            <xsd:countryCd>IND</xsd:countryCd>
                        </xsd:partyAddressDOList>
                        <xsd:partyContactDOList>
                            <xsd:contactNum>___mobile___</xsd:contactNum>
                            <xsd:contactTypeCd>MOBILE</xsd:contactTypeCd>
                            <xsd:stdCode></xsd:stdCode>
                        </xsd:partyContactDOList>
                        <xsd:partyEmailDOList>
                            <xsd:emailAddress>___email___</xsd:emailAddress>
                            <xsd:emailTypeCd>PERSONAL</xsd:emailTypeCd>
                        </xsd:partyEmailDOList>
                        <xsd:partyIdentityDOList>
                            <xsd:identityNum>___pan___</xsd:identityNum>
                            <xsd:identityTypeCd>PAN</xsd:identityTypeCd>
                        </xsd:partyIdentityDOList>
                        <xsd:partyQuestionDOList>
                            <xsd:questionCd>___member_array_question_array_code___</xsd:questionCd>
                            <xsd:response>___member_array_question_array_details___</xsd:response>
                            <xsd:questionSetCd>___member_array_question_array_setcode___</xsd:questionSetCd>
                        </xsd:partyQuestionDOList>
                        <xsd:relationCd>___member_array_relation___</xsd:relationCd>
                        <xsd:roleCd>PRIMARY</xsd:roleCd>
                        <xsd:titleCd>___member_array_salutation___</xsd:titleCd>
                        <xsd:isPaRequired>YES</xsd:isPaRequired>
                        <xsd:height>___member_array_height___</xsd:height>
                        <xsd:weight>___member_array_weight___</xsd:weight>
                    </xsd:partyDOList>
                    <!--InsurersDetail_End-->
                    <xsd:policyAdditionalFieldsDOList>
                        <xsd:field1>Partner_Landmark</xsd:field1>
						<xsd:field3>Finance-Lazypay</xsd:field3>
                        <xsd:fieldAgree>YES</xsd:fieldAgree>
                        <xsd:fieldAlerts>YES</xsd:fieldAlerts>
                        <xsd:siforCreditcard>1</xsd:siforCreditcard>
                        <xsd:fieldTc>YES</xsd:fieldTc>
                        <xsd:field10>___nominee_name___</xsd:field10>
                        <xsd:field12>___nominee_relation___</xsd:field12>
                    </xsd:policyAdditionalFieldsDOList>
                    <xsd:policyNum></xsd:policyNum>
                    <xsd:proposalNum></xsd:proposalNum>
                    <xsd:quotationReferenceNum></xsd:quotationReferenceNum>
                    <xsd:sumInsured>___health_insurance_si_2___</xsd:sumInsured>
                    <xsd:term>___policy_tenure___</xsd:term>
                    <xsd:uwDecisionCd></xsd:uwDecisionCd>
                    <xsd:isPremiumCalculation>YES</xsd:isPremiumCalculation>
                </xsd:policy>
            </rel:intIO>
        </rel:createPolicy>
    </soap:Body>
</soap:Envelope>